Info: *******************************************************************
Info: Running Quartus Prime Analysis & Synthesis
    Info: Version 18.1.0 Build 625 09/12/2018 SJ Standard Edition
    Info: Copyright (C) 2018  Intel Corporation. All rights reserved.
    Info: Your use of Intel Corporation's design tools, logic functions 
    Info: and other software and tools, and its AMPP partner logic 
    Info: functions, and any output files from any of the foregoing 
    Info: (including device programming or simulation files), and any 
    Info: associated documentation or information are expressly subject 
    Info: to the terms and conditions of the Intel Program License 
    Info: Subscription Agreement, the Intel Quartus Prime License Agreement,
    Info: the Intel FPGA IP License Agreement, or other applicable license
    Info: agreement, including, without limitation, that your use is for
    Info: the sole purpose of programming logic devices manufactured by
    Info: Intel and sold by Intel or its authorized distributors.  Please
    Info: refer to the applicable agreement for further details.
    Info: Processing started: Tue Apr 26 18:37:05 2022
Info: Command: quartus_map mp4 -c mp4
Warning (18236): Number of processors has not been specified which may cause overloading on shared machines.  Set the global assignment NUM_PARALLEL_PROCESSORS in your QSF to an appropriate value for best performance.
Info (20030): Parallel compilation is enabled and will use 2 of the 2 processors detected
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/regfile.sv
    Info (12023): Found entity 1: regfile File: /job/student/hdl/execute/regfile.sv Line: 4
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/load_store_queue.sv
    Info (12023): Found entity 1: load_store_queue File: /job/student/hdl/execute/load_store_queue.sv Line: 6
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/cmp_rs.sv
    Info (12023): Found entity 1: cmp_rs File: /job/student/hdl/execute/cmp_rs.sv Line: 6
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/cmp.sv
    Info (12023): Found entity 1: cmp File: /job/student/hdl/execute/cmp.sv Line: 5
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/alu_rs.sv
    Info (12023): Found entity 1: alu_rs File: /job/student/hdl/execute/alu_rs.sv Line: 6
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/alu.sv
    Info (12023): Found entity 1: alu File: /job/student/hdl/execute/alu.sv Line: 5
Info (12021): Found 1 design units, including 1 entities, in source file hdl/execute/ro_buffer.sv
    Info (12023): Found entity 1: ro_buffer File: /job/student/hdl/execute/ro_buffer.sv Line: 6
Info (12021): Found 1 design units, including 1 entities, in source file hdl/frontend/i_queue.sv
    Info (12023): Found entity 1: i_queue File: /job/student/hdl/frontend/i_queue.sv Line: 14
Info (12021): Found 1 design units, including 1 entities, in source file hdl/frontend/i_fetch.sv
    Info (12023): Found entity 1: i_fetch File: /job/student/hdl/frontend/i_fetch.sv Line: 4
Info (12021): Found 1 design units, including 1 entities, in source file hdl/frontend/i_decode.sv
    Info (12023): Found entity 1: i_decode File: /job/student/hdl/frontend/i_decode.sv Line: 6
Info (12021): Found 1 design units, including 1 entities, in source file hdl/frontend/br_pred.sv
    Info (12023): Found entity 1: br_pred File: /job/student/hdl/frontend/br_pred.sv Line: 1
Info (12021): Found 1 design units, including 1 entities, in source file hdl/frontend/pc_reg.sv
    Info (12023): Found entity 1: pc_register File: /job/student/hdl/frontend/pc_reg.sv Line: 5
Info (12021): Found 0 design units, including 0 entities, in source file hdl/macros.sv
Info (12021): Found 1 design units, including 1 entities, in source file hdl/mp4.sv
    Info (12023): Found entity 1: mp4 File: /job/student/hdl/mp4.sv Line: 6
Info (12021): Found 1 design units, including 0 entities, in source file hdl/rv32i_types.sv
    Info (12022): Found design unit 1: rv32i_types (SystemVerilog) File: /job/student/hdl/rv32i_types.sv Line: 3
Info (12021): Found 1 design units, including 0 entities, in source file hdl/structs.sv
    Info (12022): Found design unit 1: structs (SystemVerilog) File: /job/student/hdl/structs.sv Line: 3
Warning (12019): Can't analyze file -- file hdl/rv32i_mux_types.sv is missing
Info (12127): Elaborating entity "mp4" for the top level hierarchy
Warning (10030): Net "cdb[0].tag" at mp4.sv(58) has no driver or initial value, using a default initial value '0' File: /job/student/hdl/mp4.sv Line: 58
Warning (10030): Net "cdb[0].target_pc" at mp4.sv(58) has no driver or initial value, using a default initial value '0' File: /job/student/hdl/mp4.sv Line: 58
Warning (10030): Net "cdb[0].value" at mp4.sv(58) has no driver or initial value, using a default initial value '0' File: /job/student/hdl/mp4.sv Line: 58
Info (12128): Elaborating entity "i_fetch" for hierarchy "i_fetch:i_fetch" File: /job/student/hdl/mp4.sv Line: 95
Info (12128): Elaborating entity "pc_register" for hierarchy "i_fetch:i_fetch|pc_register:pc" File: /job/student/hdl/frontend/i_fetch.sv Line: 50
Info (12128): Elaborating entity "br_pred" for hierarchy "i_fetch:i_fetch|br_pred:predictor" File: /job/student/hdl/frontend/i_fetch.sv Line: 58
Info (12128): Elaborating entity "i_queue" for hierarchy "i_fetch:i_fetch|i_queue:i_queue" File: /job/student/hdl/frontend/i_fetch.sv Line: 75
Info (12128): Elaborating entity "i_decode" for hierarchy "i_decode:decode" File: /job/student/hdl/mp4.sv Line: 122
Warning (10036): Verilog HDL or VHDL warning at i_decode.sv(62): object "j_imm" assigned a value but never read File: /job/student/hdl/frontend/i_decode.sv Line: 62
Warning (10230): Verilog HDL assignment warning at i_decode.sv(101): truncated value with size 4 to match size of target (3) File: /job/student/hdl/frontend/i_decode.sv Line: 101
Warning (10230): Verilog HDL assignment warning at i_decode.sv(109): truncated value with size 4 to match size of target (3) File: /job/student/hdl/frontend/i_decode.sv Line: 109
Warning (10175): Verilog HDL warning at i_decode.sv(116): ignoring unsupported system task File: /job/student/hdl/frontend/i_decode.sv Line: 116
Warning (10230): Verilog HDL assignment warning at i_decode.sv(225): truncated value with size 32 to match size of target (4) File: /job/student/hdl/frontend/i_decode.sv Line: 225
Warning (10230): Verilog HDL assignment warning at i_decode.sv(309): truncated value with size 32 to match size of target (4) File: /job/student/hdl/frontend/i_decode.sv Line: 309
Warning (10175): Verilog HDL warning at i_decode.sv(322): ignoring unsupported system task File: /job/student/hdl/frontend/i_decode.sv Line: 322
Warning (10175): Verilog HDL warning at i_decode.sv(332): ignoring unsupported system task File: /job/student/hdl/frontend/i_decode.sv Line: 332
Warning (10175): Verilog HDL warning at i_decode.sv(349): ignoring unsupported system task File: /job/student/hdl/frontend/i_decode.sv Line: 349
Warning (10175): Verilog HDL warning at i_decode.sv(447): ignoring unsupported system task File: /job/student/hdl/frontend/i_decode.sv Line: 447
Info (12128): Elaborating entity "regfile" for hierarchy "regfile:reg_file" File: /job/student/hdl/mp4.sv Line: 143
Warning (10230): Verilog HDL assignment warning at regfile.sv(68): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 68
Warning (10230): Verilog HDL assignment warning at regfile.sv(69): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 69
Warning (10230): Verilog HDL assignment warning at regfile.sv(75): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 75
Warning (10230): Verilog HDL assignment warning at regfile.sv(76): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 76
Warning (10230): Verilog HDL assignment warning at regfile.sv(81): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 81
Warning (10230): Verilog HDL assignment warning at regfile.sv(82): truncated value with size 5 to match size of target (4) File: /job/student/hdl/execute/regfile.sv Line: 82
Warning (10034): Output port "alu_rs_d_out.qi_out" at regfile.sv(24) has no driver File: /job/student/hdl/execute/regfile.sv Line: 24
Warning (10034): Output port "cmp_rs_d_out.qi_out" at regfile.sv(41) has no driver File: /job/student/hdl/execute/regfile.sv Line: 41
Info (12128): Elaborating entity "load_store_queue" for hierarchy "load_store_queue:ldstbuf" File: /job/student/hdl/mp4.sv Line: 167
Warning (10230): Verilog HDL assignment warning at load_store_queue.sv(46): truncated value with size 32 to match size of target (4) File: /job/student/hdl/execute/load_store_queue.sv Line: 46
Warning (10230): Verilog HDL assignment warning at load_store_queue.sv(70): truncated value with size 32 to match size of target (3) File: /job/student/hdl/execute/load_store_queue.sv Line: 70
Warning (10230): Verilog HDL assignment warning at load_store_queue.sv(131): truncated value with size 32 to match size of target (3) File: /job/student/hdl/execute/load_store_queue.sv Line: 131
Warning (10230): Verilog HDL assignment warning at load_store_queue.sv(178): truncated value with size 32 to match size of target (3) File: /job/student/hdl/execute/load_store_queue.sv Line: 178
Info (12128): Elaborating entity "ro_buffer" for hierarchy "ro_buffer:rob" File: /job/student/hdl/mp4.sv Line: 188
Warning (10230): Verilog HDL assignment warning at ro_buffer.sv(107): truncated value with size 32 to match size of target (4) File: /job/student/hdl/execute/ro_buffer.sv Line: 107
Warning (10230): Verilog HDL assignment warning at ro_buffer.sv(108): truncated value with size 32 to match size of target (4) File: /job/student/hdl/execute/ro_buffer.sv Line: 108
Warning (10230): Verilog HDL assignment warning at ro_buffer.sv(109): truncated value with size 32 to match size of target (4) File: /job/student/hdl/execute/ro_buffer.sv Line: 109
Warning (10230): Verilog HDL assignment warning at ro_buffer.sv(136): truncated value with size 4 to match size of target (1) File: /job/student/hdl/execute/ro_buffer.sv Line: 136
Warning (10230): Verilog HDL assignment warning at ro_buffer.sv(173): truncated value with size 32 to match size of target (4) File: /job/student/hdl/execute/ro_buffer.sv Line: 173
Info (12128): Elaborating entity "alu_rs" for hierarchy "alu_rs:alu_rs" File: /job/student/hdl/mp4.sv Line: 207
Warning (10034): Output port "rs1_alu_rs_i" at alu_rs.sv(25) has no driver File: /job/student/hdl/execute/alu_rs.sv Line: 25
Warning (10034): Output port "rs2_alu_rs_i" at alu_rs.sv(25) has no driver File: /job/student/hdl/execute/alu_rs.sv Line: 25
Info (12128): Elaborating entity "alu" for hierarchy "alu_rs:alu_rs|alu:generate_alu[0].alu_instantiation" File: /job/student/hdl/execute/alu_rs.sv Line: 176
Info (12128): Elaborating entity "cmp_rs" for hierarchy "cmp_rs:cmp_rs" File: /job/student/hdl/mp4.sv Line: 225
Warning (10230): Verilog HDL assignment warning at cmp_rs.sv(168): truncated value with size 63 to match size of target (32) File: /job/student/hdl/execute/cmp_rs.sv Line: 168
Warning (10034): Output port "rs1_cmp_rs_i" at cmp_rs.sv(25) has no driver File: /job/student/hdl/execute/cmp_rs.sv Line: 25
Warning (10034): Output port "rs2_cmp_rs_i" at cmp_rs.sv(25) has no driver File: /job/student/hdl/execute/cmp_rs.sv Line: 25
Info (12128): Elaborating entity "cmp" for hierarchy "cmp_rs:cmp_rs|cmp:generate_cmp[0].cmp_instantiation" File: /job/student/hdl/execute/cmp_rs.sv Line: 188
Warning (276020): Inferred RAM node "i_fetch:i_fetch|i_queue:i_queue|queue_rtl_0" from synchronous design logic.  Pass-through logic has been added to match the read-during-write behavior of the original design.
Info (19000): Inferred 1 megafunctions from design logic
    Info (276029): Inferred altsyncram megafunction from the following design logic: "i_fetch:i_fetch|i_queue:i_queue|queue_rtl_0" 
        Info (286033): Parameter OPERATION_MODE set to DUAL_PORT
        Info (286033): Parameter WIDTH_A set to 64
        Info (286033): Parameter WIDTHAD_A set to 3
        Info (286033): Parameter NUMWORDS_A set to 8
        Info (286033): Parameter WIDTH_B set to 64
        Info (286033): Parameter WIDTHAD_B set to 3
        Info (286033): Parameter NUMWORDS_B set to 8
        Info (286033): Parameter ADDRESS_ACLR_A set to NONE
        Info (286033): Parameter OUTDATA_REG_B set to UNREGISTERED
        Info (286033): Parameter ADDRESS_ACLR_B set to NONE
        Info (286033): Parameter OUTDATA_ACLR_B set to NONE
        Info (286033): Parameter ADDRESS_REG_B set to CLOCK0
        Info (286033): Parameter INDATA_ACLR_A set to NONE
        Info (286033): Parameter WRCONTROL_ACLR_A set to NONE
        Info (286033): Parameter READ_DURING_WRITE_MODE_MIXED_PORTS set to OLD_DATA
Info (12130): Elaborated megafunction instantiation "i_fetch:i_fetch|i_queue:i_queue|altsyncram:queue_rtl_0"
Info (12133): Instantiated megafunction "i_fetch:i_fetch|i_queue:i_queue|altsyncram:queue_rtl_0" with the following parameter:
    Info (12134): Parameter "OPERATION_MODE" = "DUAL_PORT"
    Info (12134): Parameter "WIDTH_A" = "64"
    Info (12134): Parameter "WIDTHAD_A" = "3"
    Info (12134): Parameter "NUMWORDS_A" = "8"
    Info (12134): Parameter "WIDTH_B" = "64"
    Info (12134): Parameter "WIDTHAD_B" = "3"
    Info (12134): Parameter "NUMWORDS_B" = "8"
    Info (12134): Parameter "ADDRESS_ACLR_A" = "NONE"
    Info (12134): Parameter "OUTDATA_REG_B" = "UNREGISTERED"
    Info (12134): Parameter "ADDRESS_ACLR_B" = "NONE"
    Info (12134): Parameter "OUTDATA_ACLR_B" = "NONE"
    Info (12134): Parameter "ADDRESS_REG_B" = "CLOCK0"
    Info (12134): Parameter "INDATA_ACLR_A" = "NONE"
    Info (12134): Parameter "WRCONTROL_ACLR_A" = "NONE"
    Info (12134): Parameter "READ_DURING_WRITE_MODE_MIXED_PORTS" = "OLD_DATA"
Info (12021): Found 1 design units, including 1 entities, in source file db/altsyncram_74n1.tdf
    Info (12023): Found entity 1: altsyncram_74n1 File: /job/student/db/altsyncram_74n1.tdf Line: 27
Warning (13024): Output pins are stuck at VCC or GND
    Warning (13410): Pin "data_mbe[0]" is stuck at VCC File: /job/student/hdl/mp4.sv Line: 26
Info (286030): Timing-Driven Synthesis is running
Info (144001): Generated suppressed messages file /job/student/output_files/mp4.map.smsg
Info (16010): Generating hard_block partition "hard_block:auto_generated_inst"
    Info (16011): Adding 0 node(s), including 0 DDIO, 0 PLL, 0 transceiver and 0 LCELL
Warning (21074): Design contains 1 input pin(s) that do not drive logic
    Warning (15610): No output dependent on input pin "inst_resp" File: /job/student/hdl/mp4.sv Line: 20
Info (21057): Implemented 11561 device resources after synthesis - the final resource count might be different
    Info (21058): Implemented 68 input pins
    Info (21059): Implemented 103 output pins
    Info (21061): Implemented 11326 logic cells
    Info (21064): Implemented 64 RAM segments
Info: Quartus Prime Analysis & Synthesis was successful. 0 errors, 42 warnings
    Info: Peak virtual memory: 1370 megabytes
    Info: Processing ended: Tue Apr 26 18:38:38 2022
    Info: Elapsed time: 00:01:33
    Info: Total CPU time (on all processors): 00:01:39
Info: *******************************************************************
Info: Running Quartus Prime Shell
    Info: Version 18.1.0 Build 625 09/12/2018 SJ Standard Edition
    Info: Copyright (C) 2018  Intel Corporation. All rights reserved.
    Info: Your use of Intel Corporation's design tools, logic functions 
    Info: and other software and tools, and its AMPP partner logic 
    Info: functions, and any output files from any of the foregoing 
    Info: (including device programming or simulation files), and any 
    Info: associated documentation or information are expressly subject 
    Info: to the terms and conditions of the Intel Program License 
    Info: Subscription Agreement, the Intel Quartus Prime License Agreement,
    Info: the Intel FPGA IP License Agreement, or other applicable license
    Info: agreement, including, without limitation, that your use is for
    Info: the sole purpose of programming logic devices manufactured by
    Info: Intel and sold by Intel or its authorized distributors.  Please
    Info: refer to the applicable agreement for further details.
    Info: Processing started: Tue Apr 26 18:38:38 2022
Info: Command: quartus_sh -t /opt/altera/quartus/common/tcl/internal/nativelink/qnativesim.tcl --gen_script --rtl_sim mp4 mp4
Info: Quartus(args): --gen_script --rtl_sim mp4 mp4
Info: Info: Start Nativelink Simulation process
Info: Info: NativeLink has detected Verilog design -- Verilog simulation models will be used
Info: Info: Starting NativeLink simulation with ModelSim-Altera software
Info: Info: Generated ModelSim-Altera script file /job/student/simulation/modelsim/mp4_run_msim_rtl_verilog.do File: /job/student/simulation/modelsim/mp4_run_msim_rtl_verilog.do Line: 0
Info: Info: NativeLink simulation flow was successful
Info: Info: For messages from NativeLink scripts, check the file /job/student/mp4_nativelink_simulation.rpt File: /job/student/mp4_nativelink_simulation.rpt Line: 0
Info (23030): Evaluation of Tcl script /opt/altera/quartus/common/tcl/internal/nativelink/qnativesim.tcl was successful
Info: Quartus Prime Shell was successful. 0 errors, 0 warnings
    Info: Peak virtual memory: 795 megabytes
    Info: Processing ended: Tue Apr 26 18:38:39 2022
    Info: Elapsed time: 00:00:01
    Info: Total CPU time (on all processors): 00:00:00
Reading pref.tcl

# 10.5b

ModelSim> transcript on
ModelSim> > > if {[file exists rtl_work]} {
	vdel -lib rtl_work -all
}
ModelSim> vlib rtl_work
ModelSim> vmap work rtl_work
# Model Technology ModelSim - Intel FPGA Edition vmap 10.5b Lib Mapping Utility 2016.10 Oct  5 2016
# vmap work rtl_work 
# Modifying /opt/altera/modelsim_ase/linuxaloem/../modelsim.ini
ModelSim> 
> 
vlog -sv -work work +incdir+/job/student/hdl/frontend {/job/student/hdl/frontend/br_pred.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/frontend" /job/student/hdl/frontend/br_pred.sv 
# -- Compiling module br_pred
# 
# Top level modules:
# 	br_pred
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/macros.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/macros.sv 
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/rv32i_types.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/rv32i_types.sv 
# -- Compiling package rv32i_types
# 
# Top level modules:
# 	--none--
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/cmp.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/cmp.sv 
# -- Compiling package cmp_sv_unit
# -- Importing package rv32i_types
# -- Compiling module cmp
# 
# Top level modules:
# 	cmp
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/alu.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/alu.sv 
# -- Compiling package alu_sv_unit
# -- Importing package rv32i_types
# -- Compiling module alu
# 
# Top level modules:
# 	alu
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/frontend {/job/student/hdl/frontend/pc_reg.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/frontend" /job/student/hdl/frontend/pc_reg.sv 
# -- Compiling module pc_register
# 
# Top level modules:
# 	pc_register
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/structs.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/structs.sv 
# -- Compiling package structs
# -- Importing package rv32i_types
# 
# Top level modules:
# 	--none--
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/regfile.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/regfile.sv 
# -- Compiling package regfile_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module regfile
# 
# Top level modules:
# 	regfile
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/load_store_queue.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/load_store_queue.sv 
# -- Compiling package load_store_queue_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module load_store_queue
# 
# Top level modules:
# 	load_store_queue
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/cmp_rs.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/cmp_rs.sv 
# -- Compiling package cmp_rs_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module cmp_rs
# 
# Top level modules:
# 	cmp_rs
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/alu_rs.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/alu_rs.sv 
# -- Compiling package alu_rs_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module alu_rs
# 
# Top level modules:
# 	alu_rs
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/execute {/job/student/hdl/execute/ro_buffer.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/execute" /job/student/hdl/execute/ro_buffer.sv 
# -- Compiling package ro_buffer_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module ro_buffer
# 
# Top level modules:
# 	ro_buffer
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/frontend {/job/student/hdl/frontend/i_queue.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/frontend" /job/student/hdl/frontend/i_queue.sv 
# -- Compiling package i_queue_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module i_queue
# 
# Top level modules:
# 	i_queue
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/frontend {/job/student/hdl/frontend/i_fetch.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/frontend" /job/student/hdl/frontend/i_fetch.sv 
# -- Compiling package i_fetch_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module i_fetch
# 
# Top level modules:
# 	i_fetch
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl/frontend {/job/student/hdl/frontend/i_decode.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:40 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl/frontend" /job/student/hdl/frontend/i_decode.sv 
# -- Compiling package i_decode_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module i_decode
# 
# Top level modules:
# 	i_decode
# End time: 18:38:40 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hdl {/job/student/hdl/mp4.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:41 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hdl" /job/student/hdl/mp4.sv 
# -- Compiling package mp4_sv_unit
# -- Importing package rv32i_types
# -- Importing package structs
# -- Compiling module mp4
# 
# Top level modules:
# 	mp4
# End time: 18:38:41 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> 
> 
vlog -vlog01compat -work work +incdir+/job/student/hvl {/job/student/hvl/rvfimon.v}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:41 on Apr 26,2022
# vlog -vlog01compat -work work "+incdir+/job/student/hvl" /job/student/hvl/rvfimon.v 
# -- Compiling module riscv_formal_monitor_rv32imc
# -- Compiling module riscv_formal_monitor_rv32imc_rob
# -- Compiling module riscv_formal_monitor_rv32imc_isa_spec
# -- Compiling module riscv_formal_monitor_rv32imc_insn_add
# -- Compiling module riscv_formal_monitor_rv32imc_insn_addi
# -- Compiling module riscv_formal_monitor_rv32imc_insn_and
# -- Compiling module riscv_formal_monitor_rv32imc_insn_andi
# -- Compiling module riscv_formal_monitor_rv32imc_insn_auipc
# -- Compiling module riscv_formal_monitor_rv32imc_insn_beq
# -- Compiling module riscv_formal_monitor_rv32imc_insn_bge
# -- Compiling module riscv_formal_monitor_rv32imc_insn_bgeu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_blt
# -- Compiling module riscv_formal_monitor_rv32imc_insn_bltu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_bne
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_add
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_addi
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_addi16sp
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_addi4spn
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_and
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_andi
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_beqz
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_bnez
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_j
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_jal
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_jalr
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_jr
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_li
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_lui
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_lw
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_lwsp
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_mv
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_or
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_slli
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_srai
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_srli
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_sub
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_sw
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_swsp
# -- Compiling module riscv_formal_monitor_rv32imc_insn_c_xor
# -- Compiling module riscv_formal_monitor_rv32imc_insn_div
# -- Compiling module riscv_formal_monitor_rv32imc_insn_divu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_jal
# -- Compiling module riscv_formal_monitor_rv32imc_insn_jalr
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lb
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lbu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lh
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lhu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lui
# -- Compiling module riscv_formal_monitor_rv32imc_insn_lw
# -- Compiling module riscv_formal_monitor_rv32imc_insn_mul
# -- Compiling module riscv_formal_monitor_rv32imc_insn_mulh
# -- Compiling module riscv_formal_monitor_rv32imc_insn_mulhsu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_mulhu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_or
# -- Compiling module riscv_formal_monitor_rv32imc_insn_ori
# -- Compiling module riscv_formal_monitor_rv32imc_insn_rem
# -- Compiling module riscv_formal_monitor_rv32imc_insn_remu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sb
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sh
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sll
# -- Compiling module riscv_formal_monitor_rv32imc_insn_slli
# -- Compiling module riscv_formal_monitor_rv32imc_insn_slt
# -- Compiling module riscv_formal_monitor_rv32imc_insn_slti
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sltiu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sltu
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sra
# -- Compiling module riscv_formal_monitor_rv32imc_insn_srai
# -- Compiling module riscv_formal_monitor_rv32imc_insn_srl
# -- Compiling module riscv_formal_monitor_rv32imc_insn_srli
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sub
# -- Compiling module riscv_formal_monitor_rv32imc_insn_sw
# -- Compiling module riscv_formal_monitor_rv32imc_insn_xor
# -- Compiling module riscv_formal_monitor_rv32imc_insn_xori
# 
# Top level modules:
# 	riscv_formal_monitor_rv32imc
# End time: 18:38:41 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> vlog -sv -work work +incdir+/job/student/hvl {/job/student/hvl/source_tb.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:41 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hvl" /job/student/hvl/source_tb.sv 
# -- Compiling module magic_memory_dp
# -- Compiling module ParamMemory
# ** Warning: ** while parsing file included at /job/student/hvl/source_tb.sv(14)
# ** at hvl/param_memory.sv(25): (vlog-2244) Variable 'iteration' is implicitly static. You must either explicitly declare it as static or automatic
# or remove the initialization in the declaration of variable.
# -- Compiling interface rvfi_itf
# -- Compiling module shadow_memory
# -- Compiling interface tb_itf
# -- Compiling package ag_rv32i_types
# -- Compiling package source_tb_sv_unit
# -- Importing package ag_rv32i_types
# -- Compiling module source_tb
# 
# Top level modules:
# 	source_tb
# End time: 18:38:41 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 1
ModelSim> vlog -sv -work work +incdir+/job/student/hvl {/job/student/hvl/top.sv}
# Model Technology ModelSim - Intel FPGA Edition vlog 10.5b Compiler 2016.10 Oct  5 2016
# Start time: 18:38:41 on Apr 26,2022
# vlog -sv -work work "+incdir+/job/student/hvl" /job/student/hvl/top.sv 
# -- Compiling module mp4_tb
# 
# Top level modules:
# 	mp4_tb
# End time: 18:38:41 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 0
ModelSim> 
> 
vsim -t 1ps -L altera_ver -L lpm_ver -L sgate_ver -L altera_mf_ver -L altera_lnsim_ver -L arriaii_hssi_ver -L arriaii_pcie_hip_ver -L arriaii_ver -L rtl_work -L work -voptargs="+acc"  mp4_tb
# vsim -t 1ps -L altera_ver -L lpm_ver -L sgate_ver -L altera_mf_ver -L altera_lnsim_ver -L arriaii_hssi_ver -L arriaii_pcie_hip_ver -L arriaii_ver -L rtl_work -L work -voptargs=""+acc"" mp4_tb 
# Start time: 18:38:41 on Apr 26,2022
# Loading sv_std.std
# Loading work.mp4_tb
# Loading work.tb_itf
# Loading work.rvfi_itf
# Loading work.ag_rv32i_types
# Loading work.source_tb_sv_unit
# Loading work.source_tb
# Loading work.riscv_formal_monitor_rv32imc
# Loading work.riscv_formal_monitor_rv32imc_isa_spec
# Loading work.riscv_formal_monitor_rv32imc_insn_add
# Loading work.riscv_formal_monitor_rv32imc_insn_addi
# Loading work.riscv_formal_monitor_rv32imc_insn_and
# Loading work.riscv_formal_monitor_rv32imc_insn_andi
# Loading work.riscv_formal_monitor_rv32imc_insn_auipc
# Loading work.riscv_formal_monitor_rv32imc_insn_beq
# Loading work.riscv_formal_monitor_rv32imc_insn_bge
# Loading work.riscv_formal_monitor_rv32imc_insn_bgeu
# Loading work.riscv_formal_monitor_rv32imc_insn_blt
# Loading work.riscv_formal_monitor_rv32imc_insn_bltu
# Loading work.riscv_formal_monitor_rv32imc_insn_bne
# Loading work.riscv_formal_monitor_rv32imc_insn_c_add
# Loading work.riscv_formal_monitor_rv32imc_insn_c_addi
# Loading work.riscv_formal_monitor_rv32imc_insn_c_addi16sp
# Loading work.riscv_formal_monitor_rv32imc_insn_c_addi4spn
# Loading work.riscv_formal_monitor_rv32imc_insn_c_and
# Loading work.riscv_formal_monitor_rv32imc_insn_c_andi
# Loading work.riscv_formal_monitor_rv32imc_insn_c_beqz
# Loading work.riscv_formal_monitor_rv32imc_insn_c_bnez
# Loading work.riscv_formal_monitor_rv32imc_insn_c_j
# Loading work.riscv_formal_monitor_rv32imc_insn_c_jal
# Loading work.riscv_formal_monitor_rv32imc_insn_c_jalr
# Loading work.riscv_formal_monitor_rv32imc_insn_c_jr
# Loading work.riscv_formal_monitor_rv32imc_insn_c_li
# Loading work.riscv_formal_monitor_rv32imc_insn_c_lui
# Loading work.riscv_formal_monitor_rv32imc_insn_c_lw
# Loading work.riscv_formal_monitor_rv32imc_insn_c_lwsp
# Loading work.riscv_formal_monitor_rv32imc_insn_c_mv
# Loading work.riscv_formal_monitor_rv32imc_insn_c_or
# Loading work.riscv_formal_monitor_rv32imc_insn_c_slli
# Loading work.riscv_formal_monitor_rv32imc_insn_c_srai
# Loading work.riscv_formal_monitor_rv32imc_insn_c_srli
# Loading work.riscv_formal_monitor_rv32imc_insn_c_sub
# Loading work.riscv_formal_monitor_rv32imc_insn_c_sw
# Loading work.riscv_formal_monitor_rv32imc_insn_c_swsp
# Loading work.riscv_formal_monitor_rv32imc_insn_c_xor
# Loading work.riscv_formal_monitor_rv32imc_insn_div
# Loading work.riscv_formal_monitor_rv32imc_insn_divu
# Loading work.riscv_formal_monitor_rv32imc_insn_jal
# Loading work.riscv_formal_monitor_rv32imc_insn_jalr
# Loading work.riscv_formal_monitor_rv32imc_insn_lb
# Loading work.riscv_formal_monitor_rv32imc_insn_lbu
# Loading work.riscv_formal_monitor_rv32imc_insn_lh
# Loading work.riscv_formal_monitor_rv32imc_insn_lhu
# Loading work.riscv_formal_monitor_rv32imc_insn_lui
# Loading work.riscv_formal_monitor_rv32imc_insn_lw
# Loading work.riscv_formal_monitor_rv32imc_insn_mul
# Loading work.riscv_formal_monitor_rv32imc_insn_mulh
# Loading work.riscv_formal_monitor_rv32imc_insn_mulhsu
# Loading work.riscv_formal_monitor_rv32imc_insn_mulhu
# Loading work.riscv_formal_monitor_rv32imc_insn_or
# Loading work.riscv_formal_monitor_rv32imc_insn_ori
# Loading work.riscv_formal_monitor_rv32imc_insn_rem
# Loading work.riscv_formal_monitor_rv32imc_insn_remu
# Loading work.riscv_formal_monitor_rv32imc_insn_sb
# Loading work.riscv_formal_monitor_rv32imc_insn_sh
# Loading work.riscv_formal_monitor_rv32imc_insn_sll
# Loading work.riscv_formal_monitor_rv32imc_insn_slli
# Loading work.riscv_formal_monitor_rv32imc_insn_slt
# Loading work.riscv_formal_monitor_rv32imc_insn_slti
# Loading work.riscv_formal_monitor_rv32imc_insn_sltiu
# Loading work.riscv_formal_monitor_rv32imc_insn_sltu
# Loading work.riscv_formal_monitor_rv32imc_insn_sra
# Loading work.riscv_formal_monitor_rv32imc_insn_srai
# Loading work.riscv_formal_monitor_rv32imc_insn_srl
# Loading work.riscv_formal_monitor_rv32imc_insn_srli
# Loading work.riscv_formal_monitor_rv32imc_insn_sub
# Loading work.riscv_formal_monitor_rv32imc_insn_sw
# Loading work.riscv_formal_monitor_rv32imc_insn_xor
# Loading work.riscv_formal_monitor_rv32imc_insn_xori
# Loading work.riscv_formal_monitor_rv32imc_rob
# Loading work.shadow_memory
# Loading work.rv32i_types
# Loading work.structs
# Loading work.mp4_sv_unit
# Loading work.mp4
# Loading work.i_fetch_sv_unit
# Loading work.i_fetch
# Loading work.pc_register
# Loading work.br_pred
# Loading work.i_queue_sv_unit
# Loading work.i_queue
# Loading work.i_decode_sv_unit
# Loading work.i_decode
# Loading work.regfile_sv_unit
# Loading work.regfile
# Loading work.load_store_queue_sv_unit
# Loading work.load_store_queue
# Loading work.ro_buffer_sv_unit
# Loading work.ro_buffer
# Loading work.alu_rs_sv_unit
# Loading work.alu_rs
# Loading work.cmp_rs_sv_unit
# Loading work.cmp_rs
# Loading work.alu_sv_unit
# Loading work.alu
# Loading work.cmp_sv_unit
# Loading work.cmp
# Loading work.ParamMemory
# ** Warning: (vsim-3015) /job/student/hvl/source_tb.sv(228): [PCDPC] - Port size (5) does not match connection size (32) for port 'rvfi_rd_addr'. The port definition is at: /job/student/hvl/rvfimon.v(21).
#    Time: 0 ps  Iteration: 0  Instance: /mp4_tb/tb/monitor File: /job/student/hvl/rvfimon.v
# ** Warning: (vsim-3015) /job/student/hdl/execute/cmp_rs.sv(180): [PCDPC] - Port size (1) does not match connection size (32) for port 'f'. The port definition is at: /job/student/hdl/execute/cmp.sv(11).
#    Time: 0 ps  Iteration: 0  Instance: /mp4_tb/dut/cmp_rs/generate_cmp[0]/cmp_instantiation File: /job/student/hdl/execute/cmp.sv
# ** Warning: (vsim-3015) /job/student/hdl/execute/cmp_rs.sv(180): [PCDPC] - Port size (1) does not match connection size (32) for port 'f'. The port definition is at: /job/student/hdl/execute/cmp.sv(11).
#    Time: 0 ps  Iteration: 0  Instance: /mp4_tb/dut/cmp_rs/generate_cmp[1]/cmp_instantiation File: /job/student/hdl/execute/cmp.sv
# ** Warning: (vsim-3015) /job/student/hdl/execute/cmp_rs.sv(180): [PCDPC] - Port size (1) does not match connection size (32) for port 'f'. The port definition is at: /job/student/hdl/execute/cmp.sv(11).
#    Time: 0 ps  Iteration: 0  Instance: /mp4_tb/dut/cmp_rs/generate_cmp[2]/cmp_instantiation File: /job/student/hdl/execute/cmp.sv
# ** Warning: (vsim-3015) /job/student/hdl/execute/cmp_rs.sv(180): [PCDPC] - Port size (1) does not match connection size (32) for port 'f'. The port definition is at: /job/student/hdl/execute/cmp.sv(11).
#    Time: 0 ps  Iteration: 0  Instance: /mp4_tb/dut/cmp_rs/generate_cmp[3]/cmp_instantiation File: /job/student/hdl/execute/cmp.sv
VSIM 25> 
> 
add wave *
VSIM 26> view structure
VSIM 27> # 
# <EOF>
# 0: RVMODEL NULL (Expected)
# End time: 18:38:41 on Apr 26,2022, Elapsed time: 0:00:00
# Errors: 0, Warnings: 5
